pbecchi/ESP32-Sprinkler/EtherCardW5100.cpp
/* ===============================================================
   This is a fork of Rays OpenSprinkler code thats amended to use alternative hardware:

   EtherCardW5100.h and EtherCardW5100.cpp implements a minimal set of functions
   as a wrapper to replace the ENC28J60 EtherCard class libraries with the standard
   Arduino Wiznet5100 Ethernet library.

   Version:     Opensprinkler 2.1.6

   Date:        January 2016

   Repository:  https://github.com/Dave1001/OpenSprinkler-Arduino

   License:     Creative Commons Attribution-ShareAlike 3.0 license

   Refer to the README file for more information

   =============================================================== */
#include "Defines.h"
#undef DB_MASK
#define DB_MASK 4
#include <stdarg.h>
#if !defined(ESP8266) && !defined(ESP32)
#include <avr/eeprom.h>

#else
#ifndef SDFAT
#ifdef ESP8266
#include <FS.h>
#elif defined(ESP32)
#include <SPIFFS.h>

#else 
#include <SD.h>
#include <SdFat.h>
#endif
#endif
#ifndef ESP32
  #include <ESP8266mDNS.h>
#endif
#ifdef EEPROM_ESP
 #include "Eeprom_ESP.h"
#else
 #include "eeprom_mio.h"
#endif  //EEPROM_ESP
char* SSID = SSID_NAME;// "Vodafone-Out";
char* PASSWORD = WIFI_PSW;// "paolo-48";
#endif
#include "OpenSprinkler.h"
extern OpenSprinkler os;

#include "EtherCardW5100.h"

static byte ms_line = MIN_LCD_LINE;
void EtherCardW5100::message(String buf) {
	write_message(buf.c_str());
#ifdef LCD_SSD1306	
	os.lcd_print_line_clear_pgm(buf.c_str(), ms_line);
	ms_line++;
	ms_line += buf.length() / 22;
	if (ms_line > MAX_LCD_LINE)ms_line = MIN_LCD_LINE;
#endif
}

//================================================================
// Utility functions
//================================================================

/// <summary>
/// Copy four bytes to an IPAddress object
/// </summary>
/// <param name="src">Pointer to the 4 byte source</param>
/// <returns></returns>
IPAddress Byte2IP ( const byte *src )
{
    return IPAddress ( src[0], src[1], src[2], src[3] );
}

/// <summary>
/// Copy an IPAddress object to four bytes
/// </summary>
/// <param name="src">Pointer to the 4 byte source</param>
/// <returns></returns>
void IP2Byte ( IPAddress ip, byte *dest )
{
    dest[0] = ip[0];
    dest[1] = ip[1];
    dest[2] = ip[2];
    dest[3] = ip[3];
}

/// <summary>
/// ethercard.cpp - convert a two byte word to ascii
/// </summary>
/// <param name="value"></param>
/// <param name="ptr"></param>
/// <returns></returns>
char* BufferFiller::wtoa ( uint16_t value, char* ptr )
{
    if ( value > 9 )
        ptr = wtoa ( value / 10, ptr );
    *ptr = '0' + value % 10;
    *++ptr = 0;
    return ptr;
}

/// <summary>
/// webutil.cpp - convert a single hex digit character to its integer value
/// </summary>
/// <param name="c">single character</param>
/// <returns>integer value</returns>
unsigned char EtherCardW5100::h2int ( char c )
{
    if ( c >= '0' && c <= '9' )
    {
        return ( ( unsigned char ) c - '0' );
    }
    if ( c >= 'a' && c <= 'f' )
    {
        return ( ( unsigned char ) c - 'a' + 10 );
    }
    if ( c >= 'A' && c <= 'F' )
    {
        return ( ( unsigned char ) c - 'A' + 10 );
    }
    return ( 0 );
}

/// <summary>
/// webutil.cpp - convert a single character to a 2 digit hex str
/// </summary>
/// <param name="c">single char</param>
/// <param name="hstr">2 digit hex string with terminating '\0'</param>
void EtherCardW5100::int2h ( char c, char *hstr )
{
    hstr[1] = ( c & 0xf ) + '0';
    if ( ( c & 0xf ) >9 )
    {
        hstr[1] = ( c & 0xf ) - 10 + 'a';
    }
    c = ( c >> 4 ) & 0xf;
    hstr[0] = c + '0';
    if ( c > 9 )
    {
        hstr[0] = c - 10 + 'a';
    }
    hstr[2] = '\0';
}

//================================================================
// Bufferfiller object
//================================================================

/// <summary>
/// This class populates network send and receive buffers.
/// This class provides formatted printing into memory. Users can use it to write into send buffers.
/// </summary>
/// <param name="fmt">PGM_P : is a pointer to a string in program space(defined in the source code)</param>
void BufferFiller::emit_p ( PGM_P fmt, ... )
{
    va_list ap;
    va_start ( ap, fmt );
    for ( ;; )
    {
        char c = pgm_read_byte ( fmt++ );
        if ( c == 0 )
            break;
        if ( c != '$' )
        {
            *ptr++ = c;
            continue;
        }
        c = pgm_read_byte ( fmt++ );
        switch ( c )
        {
        case 'D':
#ifdef __AVR__
            wtoa ( va_arg ( ap, uint16_t ), ( char* ) ptr );
#else
            wtoa ( va_arg ( ap, int ), ( char* ) ptr );
#endif
            break;
#ifdef FLOATEMIT
        case 'T':
            dtostrf ( va_arg ( ap, double ), 10, 3, ( char* ) ptr );
            break;
#endif
        case 'H':
        {
#ifdef __AVR__
            char p1 = va_arg ( ap, uint16_t );
#else
            char p1 = va_arg ( ap, int );
#endif
            char p2;
            p2 = ( p1 >> 4 ) & 0x0F;
            p1 = p1 & 0x0F;
            if ( p1 > 9 ) p1 += 0x07; // adjust 0x0a-0x0f to come out 'a'-'f'
            p1 += 0x30;             // and complete
            if ( p2 > 9 ) p2 += 0x07; // adjust 0x0a-0x0f to come out 'a'-'f'
            p2 += 0x30;             // and complete
            *ptr++ = p2;
            *ptr++ = p1;
            continue;
        }
        case 'L':
            ltoa ( va_arg ( ap, long ), ( char* ) ptr, 10 );
            break;
        case 'S':
            strcpy ( ( char* ) ptr, va_arg ( ap, const char* ) );
            break;
        case 'F':
        {
            PGM_P s = va_arg ( ap, PGM_P );
            char d;
            while ( ( d = pgm_read_byte ( s++ ) ) != 0 )
                *ptr++ = d;
            continue;
        }
        case 'E':
        {
            byte* s = va_arg ( ap, byte* );
            char d;
            while ( ( d = eeprom_read_byte ( s++ ) ) != 0 )
                *ptr++ = d;
            continue;
        }
        default:
            *ptr++ = c;
            continue;
        }
        ptr += strlen ( ( char* ) ptr );
    }
    va_end ( ap );
}

//================================================================

EtherCardW5100 ether;

// Declare static data members (ethercard.cpp)
uint8_t EtherCardW5100::mymac[6];				// MAC address
uint8_t EtherCardW5100::myip[4];				// IP address
uint8_t EtherCardW5100::netmask[4];				// Netmask
uint8_t EtherCardW5100::gwip[4];				// Gateway
uint8_t EtherCardW5100::dhcpip[4];				// DHCP server IP address
uint8_t EtherCardW5100::dnsip[4];				// DNS server IP address
uint8_t EtherCardW5100::hisip[4];				// DNS lookup result
uint16_t EtherCardW5100::hisport = 80;			// TCP port to connect to (default 80)
bool EtherCardW5100::using_dhcp;				// True if using DHCP
// NOT IMPLEMENTED
// uint8_t EtherCardW5100::broadcastip[4];		// Subnet broadcast address
// bool EtherCardW5100::persist_tcp_connection; // False to break connections on first packet received
// uint16_t EtherCardW5100::delaycnt = 0;		// Counts number of cycles of packetLoop when no packet received - used to trigger periodic gateway ARP request

