pbecchi/ESP32-Sprinkler/EtherCardW5100.cpp
// Declare static data members from enc28j60.h
uint16_t EtherCardW5100::bufferSize;
boolean EtherCardW5100::netflag = false;
// Declare static data members for this wrapper class
IPAddress EtherCardW5100::ntpip;
#ifdef MY_PING
SOCKET EtherCardW5100::ping_socket = 0;
ICMPPing EtherCardW5100::ping ( ping_socket, 1 );
ICMPEchoReply EtherCardW5100::ping_result;
#endif

ETHERNES EtherCardW5100::incoming_server ( hisport );
//ETHERNES EtherCardW5100::incoming_server(80);
ETHERNEC EtherCardW5100::incoming_client;
ETHERNEC EtherCardW5100::outgoing_client;
ETHERNEUDP EtherCardW5100::udp_client;
#ifndef ESP32
DNSClient EtherCardW5100::dns_client;
#endif
// Declare static data (from tcpip.cpp)
static uint8_t www_fd = 0;						// ID of current http request (only one http request at a time - one of the 8 possible concurrent TCP/IP connections)
static const char *client_urlbuf;				// Pointer to c-string path part of HTTP request URL
static const char *client_urlbuf_var;			// Pointer to c-string filename part of HTTP request URL
static const char *client_hoststr;				// Pointer to c-string hostname of current HTTP request
static const char *client_additionalheaderline;	// Pointer to c-string additional http request header info
static const char *client_postval;
static tcpstate_t outgoing_client_state;		//TCP connection state: 1=Send SYN, 2=SYN sent awaiting SYN+ACK, 3=Established, 4=Not used, 5=Closing, 6=Closed
static void ( *client_browser_cb ) ( uint8_t, uint16_t, uint16_t );	// Pointer to callback function to handle result of current HTTP request

// External variables defined in main .ino file
extern BufferFiller bfill;

//=================================================================================
// Ethercard Wrapper Functions
//=================================================================================

/// <summary>
/// Initialise the network interface
/// </summary>
/// <param name="size">Size of data buffer (not used)</param>
/// <param name="macaddr">Hardware address to assign to the network interface (6 bytes) (not used)</param>
/// <param name="csPin">Arduino pin number connected to chip select. Default = 8</param>
/// <returns>Firmware version or zero on failure.</returns>
uint8_t EtherCardW5100::begin ( const uint16_t size, const uint8_t* macaddr, uint8_t csPin )
{
    using_dhcp = false;
    copyMac ( mymac, macaddr );
    return 1; //0 means fail
}
//////////////////////////////////////////////////////////////////scanNetwork()///////////////////////////////////////
String found_SSID[5], found_psw[5];

char* CharFromString(String uno) {
	
	char *a = new char[uno.length() +1];
		a[uno.length()] = 0;
	memcpy(a, uno.c_str(), uno.length());
	DEBUG_PRINT(a); DEBUG_PRINT(strlen(a));
/*
	int i = 0;
	while (uno[i++] != 0) {
		res[i - 1] = uno[i - 1]; DEBUG_PRINT(res[i - 1]);
	}*/
	return a;
}
#ifdef WIFIMANAGER
void configModeCallback(WiFiManager *myWiFiManager) {
	os.lcd_print_line_clear_pgm(PSTR("Conf WiFi..."), 0);
	os.lcd_print_line_clear_pgm(PSTR("Go 192.168.4.1 "), 1);
	Serial.println("Go 192.168.4.1 ");
}
#endif

byte EtherCardW5100::scanNetwork(byte flag)
// scan network and return n.network with known password found stored on found_SSID[] and found_psw[] 
// if no one is known or netflag is set open configuration portal new network are append to file,
{

	byte netCount = 0;
	DEBUG_PRINTLN("scan start");

	// WiFi.scanNetworks will return the number of networks found
	int n = WiFi.scanNetworks();
	//message("scan done");
	if (n == 0)
	{
		message("no networks found");
		return 0;
	}
	else
	{
#ifdef WIFIMULTI
#include <ESP8266WiFiMulti.h>
		struct WiFiAP {	
			char	APname[20]; APpsw[20];
		};
		WiFiAP wifiAP[10];
		byte n=eepro_read_byte(WIFIAP_POS);
		for (byte i = 0; i < n; i++)
		{
			eeprom_read_block(&wifiAP, WIFIAP_POS + i * sizeof(wifiAP), sizeof(wifiAP));
			wifim.addAP(APname[i], APpsw[i]);
		}
#else
		String Ssid[10];
		String psw[10];
		File file;
		int PaswKnown = -1;
		int Npas = 0;
		if (!SPIFFS.exists("/SSID_PASSWORD"))
			file = SPIFFS.open("/SSID_PASSWORD", "w");               //new password file
		else
		{    //-----------------read SSID and PASSWORD from file.

			Serial.println("Reading password file....");
			file = SPIFFS.open("SSID_PASSWORD", "a+");               //read passwords from file
			file.seek(0, SeekSet);
			while (file.available())
			{
				char buff[20] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };
				file.readBytesUntil(',', buff, 20);

				Ssid[Npas] = buff;
				char buf[20] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };

				int n=file.readBytesUntil('\n', buf, 20);
				buf[n-1] = 0;
				psw[Npas++] = buf;
				Serial.print(Ssid[Npas - 1]);
				Serial.print('\t'); Serial.print("<>"); Serial.println(psw[Npas - 1]);
			}
		}
		Serial.print("read:");
		Serial.println(Npas);
		
		//message(" networks found");
		byte ind[10] = { 0,1,2,3,4,5,6,7,8,9 };
		byte ii = 1; 
			while (ii != 0)
			{
				ii = 0;
				for (byte j = 0; j < n - 1; j++)

					if (WiFi.RSSI(ind[j]) <= WiFi.RSSI(ind[j + 1])) {
						ii = ind[j]; ind[j] = ind[j + 1]; ind[j + 1] = ii;
					}
			}
		for (int ii = 0; ii < n; ++ii)
		{
			int i = ind[ii];
			// Print SSID and RSSI for each network found
			
			Serial.print(i);
			Serial.print(": ");
			int jpas = Npas - 1;
			while (WiFi.SSID(i) != Ssid[jpas] && jpas >= 0)jpas--;
			if (jpas >= 0)PaswKnown = i;
			Serial.print(WiFi.SSID(i));
			Serial.print(" (");
			Serial.print(WiFi.RSSI(i));
			Serial.print(")");
#ifdef ESP8266
			Serial.print((WiFi.encryptionType(i) ==  ENC_TYPE_NONE) ? " " : "*");
#endif
			// ---need to order with RSSI???????????????????
			if (jpas >= 0) {
				Serial.println(" passw. available"); netCount++;
				found_SSID[netCount-1] = Ssid[jpas];
				found_psw[netCount-1] = psw[jpas];

			}

			else Serial.println();
			delay(10);
		}

		if (PaswKnown < 0||flag==1||EtherCardW5100::netflag)
		{
#ifdef WIFIMANAGER
			WiFiManager wifiManager;
			wifiManager.setConfigPortalTimeout(120);
			/*
			IPAddress ip = IPAddress(my_ip[0], my_ip[1], my_ip[2], my_ip[3]);
			IPAddress gw = IPAddress(gw_ip[0], gw_ip[1], gw_ip[2], gw_ip[3]);
			IPAddress subnet = IPAddress(255, 255, 255, 0);
			DEBUG_PRINTLN(ip);

			wifiManager.setSTAStaticIPConfig(ip, gw, subnet);*/
			wifiManager.setAPCallback(configModeCallback);
			//
			//	if button 2 has been pressed will start configuration portal to select a different network
			//
				wifiManager.resetSettings();
				if (wifiManager.startConfigPortal("MyConnectAP")) {
					netCount++;
					//!!!!!!!!!!reconnect in station mode!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
					DEBUG_PRINTLN(WiFi.getMode());
					found_SSID[netCount-1] = WiFi.SSID();
					found_psw[netCount-1] = WiFi.psk();
					file.print(WiFi.SSID()); file.print(','); file.println(WiFi.psk());
					WiFi.disconnect();
					file.close();
					EtherCardW5100::netflag = false;
				}
				else return 0;
#else //WIFIMANAGER
//read from usb
			Serial.println("Select network n.");
			while (!Serial.available()&&millis()<180000) delay(10);
			if (millis() > 180000)return 0;
			byte ch = Serial.read();
			Ssid[Npas] = WiFi.SSID(ch - '0');
			while (Serial.available())Serial.read();
			Serial.print("Enter password for "); Serial.println(Ssid[Npas]);
			while (!Serial.available()) delay(10);
			psw[Npas] = Serial.readStringUntil(10);
			Serial.print(Ssid[Npas]); Serial.print(','); Serial.println(psw[Npas]);


			////////// append to file///////////////////			
			file.print(Ssid[Npas]); file.print(','); file.println(psw[Npas]);
			file.close();
#endif
			
