pbecchi/ESP32-Sprinkler/EtherCardW5100.cpp
		}
#endif
	}


	return netCount;
}
/// <summary>
/// Configure network interface with static IP
/// </summary>
/// <param name="my_ip">IP address (4 bytes). 0 for no change.</param>
/// <param name="gw_ip">Gateway address (4 bytes). 0 for no change. Default = 0</param>
/// <param name="dns_ip">DNS address (4 bytes). 0 for no change. Default = 0</param>
/// <param name="mask">Subnet mask (4 bytes). 0 for no change. Default = 0</param>
/// <returns>Returns true on success - actually always true</returns>


byte EtherCardW5100::WiFiLevel(byte itnet) {
//	WiFi.scanNetworks();
	return WiFi.RSSI();
	
}


bool EtherCardW5100::staticSetup
(const uint8_t* my_ip, const uint8_t* gw_ip, const uint8_t* dns_ip, const uint8_t* mask)
{
	using_dhcp = false;

	
#if defined(ESP8266) || defined(ESP32)
	bool result = false;
#if WIFIMANAGER == 1
	uint8_t n = 0;
		uint8_t nNetwork = scanNetwork(0);
	if (nNetwork == 0)
	{
		message("no net"); ESP.restart();
	}
	//________________connect to first available network________________
	while (n < nNetwork&&!result) {
		SSID =  CharFromString(found_SSID[n]);
		PASSWORD =  CharFromString(found_psw[n]);
		n++;
		if (PASSWORD[strlen(PASSWORD) - 1] < '0')PASSWORD[strlen(PASSWORD) - 1] = 0;

		DEBUG_PRINTLN(strlen(PASSWORD));
		result = WiFiconnect( my_ip, gw_ip,  dns_ip,  mask);
	}
#elif defined(WIFIMANAGER)
	WiFiManager wifiManager;
	wifiManager.setConfigPortalTimeout(120);
	IPAddress ip = IPAddress(my_ip[0],my_ip[1],my_ip[2],my_ip[3]);
	IPAddress gw = IPAddress(gw_ip[0], gw_ip[1], gw_ip[2], gw_ip[3]); 
	IPAddress dns = IPAddress(dns_ip[0], dns_ip[1], dns_ip[2], dns_ip[3]);
	IPAddress subnet = IPAddress(255,255,255,0);
	DEBUG_PRINTLN(ip);

	wifiManager.setSTAStaticIPConfig(ip,gw, subnet,dns);
	wifiManager.setAPCallback(configModeCallback);
	//
	//	if button 2 has been pressed will start configuration portal to select a different network
	//
	if (netflag)
	{
		wifiManager.resetSettings();
		result = wifiManager.startConfigPortal("AutoConnectAP");
		netflag = false;
	}
	else
		result=wifiManager.autoConnect("MyConnectAP");
	//!!!!!!!!!!reconnect in station mode!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	DEBUG_PRINTLN(WiFi.getMode());
#else
	result = WiFiconnect(my_ip, gw_ip, dns_ip, mask);
#endif //WIFIMANAGER

#else
	
	IPAddress ip = Byte2IP ( my_ip );
	IPAddress gw = Byte2IP ( gw_ip );
	IPAddress subnet = Byte2IP ( mask );*/
	// initialize the ethernet device and start listening for clients
	ETHERNE.begin(mymac, ip, gw, subnet);

#endif
	if (result) {
		String outstr = "Conn. ";
		outstr+=	WiFi.SSID();
		message(outstr);
		incoming_server.begin();



		// save the values
		IP2Byte(ETHERNE.localIP(), myip);
		IP2Byte(ETHERNE.gatewayIP(), gwip);
		IP2Byte(ETHERNE.dnsIP(), dnsip);
		IP2Byte(ETHERNE.subnetMask(), netmask);

		// print debug values
		printIPConfig();
	}
    return result;
}
#if defined(ESP8266) || defined(ESP32)
bool EtherCardW5100::WiFiconnect()
{
	//if (WiFi.status() != WL_CONNECTED)
	{
		// convert bytes to IPAddress
//		IPAddress ip = Byte2IP(my_ip);
	//	IPAddress gw = Byte2IP(gw_ip);
		//IPAddress subnet = Byte2IP(mask);
		DEBUG_PRINTLN("Wait WIFI...");
		WiFi.mode(WIFI_STA);
	//	while (millis() < 60000) delay(2);
		WiFi.begin(SSID, PASSWORD);// , my_ip, dns_ip, gw_ip);
								   //		byte netmask[4] = { 255,255,255,0 };
								   //		byte MyIp[4] = { 192,168,1,211 };
								   //		byte MyGate[4] = { 192,168,1,1 };

	//	if (isStatic) WiFi.config(ip, gw, subnet);
		DEBUG_PRINT("\nConnecting to "); DEBUG_PRINTLN(SSID);
		uint8_t i = 0;
		while (WiFi.status() != WL_CONNECTED && i++ <= 201) { yield(); delay(400); DEBUG_PRINT('.'); }
		if (i >= 201) {
			DEBUG_PRINT("Could not connect to"); DEBUG_PRINTLN(SSID);
			return false;
		}
		DEBUG_PRINT("Server started IP="); DEBUG_PRINTLN(WiFi.localIP());
		return true;
	}
}
bool EtherCardW5100::WiFiconnect( const uint8_t* my_ip, const uint8_t* gw_ip, const uint8_t* dns_ip, const uint8_t* mask)
{
	//if (WiFi.status() != WL_CONNECTED)
	{
	// convert bytes to IPAddress
/*	IPAddress ip = Byte2IP ( my_ip );
	IPAddress gw = Byte2IP ( gw_ip );
	IPAddress subnet = Byte2IP ( mask );
	*/
		DEBUG_PRINTLN("Wait WIFI...");
		WiFi.mode(WIFI_STA);
		//while (millis() < 10000) delay(2);
		WiFi.begin(SSID, PASSWORD);// , my_ip, dns_ip, gw_ip);
		byte netmask[4] = { 255,255,255,0 };

		 WiFi.config(my_ip, gw_ip, netmask,dns_ip);
		DEBUG_PRINT("\nConnecting to "); DEBUG_PRINTLN(SSID);
		uint8_t i = 0;
		while (WiFi.status() != WL_CONNECTED && i++ <=201) { yield(); delay(400); DEBUG_PRINT('.'); }
		if (i >= 201) {
			DEBUG_PRINT("Could not connect to"); DEBUG_PRINTLN(SSID);
			return false;
		}

		DEBUG_PRINT("Server started IP="); DEBUG_PRINTLN(WiFi.localIP());
		return true;
	}
}
#endif


/// <summary>
/// Configure network interface with DHCP
/// </summary>
/// <param name="hname">hostname (not implememted)</param>
/// <param name="fromRam">lookup from RAM</param>
/// <returns>True if DHCP successful</returns>
bool EtherCardW5100::dhcpSetup ( const char *hname, bool fromRam )
{
    using_dhcp = true;

    // initialize the ethernet device
#if !defined(ESP8266) && !defined(ESP32)
	if (ETHERNE.begin(mymac) == 0)
#else
#if WIFIMANAGER == 1
	bool result = false;
	for (byte i = 0; i <= 1; i++) {
		uint8_t n = 0;
		uint8_t nNetwork = scanNetwork(i);
		while (n < nNetwork && !result) {
			SSID = CharFromString(found_SSID[n]);

			//   found_SSID[n];
			PASSWORD = CharFromString(found_psw[n]); //found_psw[n];
			//delete special char at the end/////////////////////////////////////
			if (PASSWORD[strlen(PASSWORD) - 1] < '0')PASSWORD[strlen(PASSWORD) - 1] = 0;

			DEBUG_PRINTLN(strlen(PASSWORD));
			n++;
			result = WiFiconnect();
		}
		if (result)break;
	}
	if (!result )return false;
#elif defined(WIFIMANAGER)
	WiFiManager wifiManager;
	wifiManager.setConfigPortalTimeout(120);
	wifiManager.setAPCallback(configModeCallback);
	if (netflag)
	{
		wifiManager.resetSettings();
		bool	result = wifiManager.startConfigPortal("AutoConnectAP");
		netflag = false;
	}
	else
   bool 	result = wifiManager.autoConnect("AutoConnectAP");
//!!!!!!!!!!reconnect in station mode!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	DEBUG_PRINTLN(WiFi.getMode());
/*	WiFi.disconnect();
	delay(1000);

	WiFi.mode(WIFI_STA);
	WiFi.begin();
	int i = 0;
	while (WiFi.status() != WL_CONNECTED && i++ <= 201) {  delay(400); DEBUG_PRINT('.'); }
	if (i >= 201) {
		DEBUG_PRINT("Could not connect to"); DEBUG_PRINTLN(WiFi.BSSIDstr());
		return false;

