pbecchi/ESP32-Sprinkler/EtherCardW5100.cpp
	}
	DEBUG_PRINTLN(WiFi.getMode());*/
#else
bool	result = WiFiconnect();

#endif

#ifdef HOSTNAM
	
		// Set up mDNS responder:
		// - first argument is the domain name, in this example
		//   the fully-qualified domain name is "esp8266.local"
		// - second argument is the IP address to advertise
		//   we send our IP address on the WiFi network
		char *  hostname = "OS";
#define  DHCP_HOSTNAME_MAX_LEN 10


		//do not  Ignore the hostname - need to extend the standard Arduino ethernet library to implement this
		if (hname != NULL)
		{
			if (fromRam)
			{
				strncpy(hostname, hname, DHCP_HOSTNAME_MAX_LEN);
			}
			else
			{
				strncpy_P(hostname, hname, DHCP_HOSTNAME_MAX_LEN);
			}
		}
		else
		{
			hostname = "OS";
			// Set a unique hostname, use Arduino-?? with last octet of mac address
			// ESP HW n. last 2 digit
			long cod = ESP.getChipId();

			hostname[3] = (cod % 10 + '0');
			hostname[2] = (cod % 100 / 10) + ('0');
			hostname[4] = 0;

		}
		//hostname = "prova";
		DEBUG_PRINT("Hostname:   ");
		DEBUG_PRINTLN(hostname);


		if (!MDNS.begin(hostname)) {
			Serial.println("Error setting up MDNS responder!");
			while (1) {
				delay(1000);
			}
		}
		Serial.println("mDNS responder started");
	
#endif
#endif
		// start listening for clients
    incoming_server.begin();
 //   udp_client.begin ( NTP_CLIENT_PORT );
    // save the values
    IP2Byte ( ETHERNE.localIP(), myip );
    IP2Byte (ETHERNE.gatewayIP(), gwip );
    IP2Byte (ETHERNE.dnsIP(), dnsip );
    IP2Byte (ETHERNE.subnetMask(), netmask );

    // print debug values
    printIPConfig();
	delay(4000);
#ifndef HOSTNAM
    return true;
#else
#if defined(ESP8266) || defined(ESP32)	
	// Add service to MDNS-SD
	String outstr = "Conn. ";
	outstr += WiFi.SSID();
	message(outstr);

	MDNS.addService("http", "tcp", 80);
	return true;
#else	
	DEBUG_PRINT(F("Hostname:   "));
	DEBUG_PRINT(hostname);
	//DEBUG_PRINTLN(F("(not implemented)"));

	dhcpState = DHCP_STATE_INIT;
	uint16_t start = millis();

	while (dhcpState != DHCP_STATE_BOUND && uint16_t(millis()) - start < 60000) {
	if (isLinkUp()) DhcpStateMachine(packetReceive());
	}
	updateBroadcastAddress();
	delaycnt = 0;
	return dhcpState == DHCP_STATE_BOUND;

#endif //ESP8266
#endif //HOSTNAM
}

/// <summary>
/// Print the current network configuration to the serial port
/// </summary>
void EtherCardW5100::printIPConfig()
{
#ifdef SERIAL_DEBUG
    DEBUG_PRINT ( F ( "Config:     " ) );
    DEBUG_PRINTLN ( using_dhcp ? F ( "DHCP" ) : F ( "Static IP" ) );

    DEBUG_PRINT ( F ( "MAC:        " ) );
    DEBUG_PRINTF ( mymac[0], HEX );
    DEBUG_PRINT ( F ( ":" ) );
    DEBUG_PRINTF ( mymac[1], HEX );
    DEBUG_PRINT ( F ( ":" ) );
    DEBUG_PRINTF ( mymac[2], HEX );
    DEBUG_PRINT ( F ( ":" ) );
    DEBUG_PRINTF ( mymac[3], HEX );
    DEBUG_PRINT ( F ( ":" ) );
    DEBUG_PRINTF ( mymac[4], HEX );
    DEBUG_PRINT ( F ( ":" ) );
    DEBUG_PRINTF ( mymac[5], HEX );
    DEBUG_PRINTLN();

    printIp ( F ( "Local IP:   " ), myip );
    printIp ( F ( "Gateway IP: " ), gwip );
    printIp ( F ( "DNS IP:     " ), dnsip );

    printIp ( F ( "Netmask:    " ), netmask );
	IPAddress timeServer;
	Serial.println(WiFi.dnsIP());
	WiFi.hostByName("time.nist.gov", timeServer);
	Serial.println(timeServer);

#endif
}

/// <summary>
/// Parse received data
/// Note that data buffer is shared by receive and transmit functions
/// Only handles TCP (not UDP)
/// </summary>
/// <param name="plen">Size of data to parse(e.g. return value of packetReceive()).</param>
/// <returns>Offset of TCP payload data in data buffer or zero if packet processed</returns>
uint16_t EtherCardW5100::packetLoop ( uint16_t plen )
{
    uint16_t len = 0;

    // remember that plen passed in from packetReceive is data length plus
    // a dummy TCP header (the rest of the TCP packet is stripped out)
	//DEBUG_PRINTLN(plen);
    // nothing received
    if ( plen == 0 )
    {    
        // Receive incoming TCP data for client
        if ( outgoing_client_state == TCP_ESTABLISHED )
		{
			//DEBUG_PRINT('>');
            if ( outgoing_client.available() )
            {
                DEBUG_PRINT ( F ( "Browse URL: client received: " ) );

                // set all bytes in the buffer to 0 - add a
                // byte to simulate space for the TCP header
                memset ( buffer, 0, ETHER_BUFFER_SIZE );
                memset ( buffer, ' ', TCP_OFFSET );
                len = TCP_OFFSET;

                while ( outgoing_client.available() && ( len < ETHER_BUFFER_SIZE ) )
                {
                    buffer[len] = outgoing_client.read();
                    DEBUG_PRINT ( char(buffer[len]&0xFF) );
                    len++;
                }
                DEBUG_PRINTLN ( F ( "" ) );

                // send data to the callback
                if ( len > TCP_OFFSET )
                {
                    ( *client_browser_cb ) ( 0, TCP_OFFSET, len );
                }
                // if the server has disconnected, stop the client
                if ( !outgoing_client.connected() )
                {
                    DEBUG_PRINTLN ( F ( "Browse URL: client disconnected" ) );
                    outgoing_client.stop();
                    outgoing_client_state = TCP_CLOSED;
                }
            }
        }

        // Check for renewal of DHCP lease
  
#if !defined(ESP8266) && !defined(ESP32)
		if (using_dhcp)
		ETHERNE.maintain();  
#endif
        return 0;
    }
    else
    {
        //If we are here then this is a TCP/IP packet targetted at us and not
        // related to our client connection so accept treat it as a new request
        return TCP_OFFSET;
    }
}

/// <summary>
/// Send NTP request
/// </summary>
/// <param name="nt_pip">IP address of NTP server</param>
/// <param name="srcport">IP port to send from</param>
void EtherCardW5100::ntpRequest ( uint8_t *ntp_ip, uint8_t srcport )
{
    // set all bytes in the buffer to 0
    memset ( buffer, 0, ETHER_BUFFER_SIZE );

    // Initialize values needed to form NTP request
    buffer[0] = 0b11100011;    // LI, Version, Mode
    buffer[1] = 0;             // Stratum, or type of clock
    buffer[2] = 6;             // Polling Interval
    buffer[3] = 0xEC;          // Peer Clock Precision
    // 8 bytes of zero for Root Delay & Root Dispersion
    buffer[12] = 49;
    buffer[13] = 0x4E;
    buffer[14] = 49;
    buffer[15] = 52;

    // If a zero IP address is set, use a pool ntp server (this is more reliable)
    if ( ntp_ip[0] == 0 && ntp_ip[1] == 0 && ntp_ip[2] == 0 && ntp_ip[3] == 0 )
    {
        if ( dnsLookup ( "pool.ntp.org", false ) )
            ntpip = IPAddress ( hisip[0], hisip[1], hisip[2], hisip[3] );
        else
        {
            DEBUG_PRINT ( F ( "NTP request failed - could not resolve IP" ) );
            return;
        }
    }
    else
        ntpip = IPAddress ( ntp_ip[0], ntp_ip[1], ntp_ip[2], ntp_ip[3] );

    // all NTP fields have been given values, now you can send a packet requesting a timestamp:
	udp_client.begin(srcport);

    udp_client.beginPacket ( ntpip, NTP_CLIENT_PORT );		// NTP requests are to port 123
    udp_client.write ( buffer, NTP_PACKET_SIZE );
    udp_client.endPacket();

    DEBUG_PRINT ( F ( "NTP request sent to " ) );
    printIp ( ntp_ip );
    DEBUG_PRINT ( F ( ": " ) );

#ifdef SERIAL_DEBUG
    for ( uint8_t c = 0; c < 16; c++ )
    {
        DEBUG_PRINTF ( buffer[c], HEX );
        DEBUG_PRINT ( F ( " " ) );
    }
#endif
    DEBUG_PRINTLN ( "" );
}

/// added 
int EtherCardW5100::Udp_parsePacket() { return udp_client.parsePacket(); }

/// <summary>
/// Ethercard.cpp - Process network time protocol response
/// </summary>
/// <param name="time">Pointer to integer to hold result</param>
/// <param name="dstport_l">Destination port to expect response. Set to zero to accept on any port</param>
/// <returns>True (1) on success</returns>
byte EtherCardW5100::ntpProcessAnswer ( uint32_t *time, byte dstport_l )
{

    int packetSize = udp_client.parsePacket();
    if ( packetSize )
    {
        DEBUG_PRINT ( F ( "NTP response received from " ) );
        DEBUG_PRINT ( udp_client.remoteIP() [0] );
        DEBUG_PRINT ( F ( "." ) );
        DEBUG_PRINT ( udp_client.remoteIP() [1] );
        DEBUG_PRINT ( F ( "." ) );
        DEBUG_PRINT ( udp_client.remoteIP() [2] );
        DEBUG_PRINT ( F ( "." ) );
        DEBUG_PRINT ( udp_client.remoteIP() [3] );
        DEBUG_PRINT ( F ( ":" ) );

        // check the packet is from the correct timeserver IP and port
        if ( udp_client.remotePort() != 123 || udp_client.remoteIP() != ntpip )
        {
            DEBUG_PRINTLN ( F ( " (invalid IP or port)" ) );
            return 0;
        }

        //the timestamp starts at byte 40 of the received packet and is four bytes, or two words, long.
        udp_client.read ( buffer, packetSize );
        ( ( byte* ) time ) [3] = buffer[40];
        ( ( byte* ) time ) [2] = buffer[41];
        ( ( byte* ) time ) [1] = buffer[42];
        ( ( byte* ) time ) [0] = buffer[43];

        DEBUG_PRINTLN ( ( uint32_t ) time );
        return 1;
    }
    return 0;
}

