pbecchi/ESP32-Sprinkler/EtherCardW5100.cpp
//=================================================================================
// Webutil.cpp
//=================================================================================

/// <summary>
/// webutil.cpp - copies an IP address
/// There is no check of source or destination size. Ensure both are 4 bytes
/// </summary>
/// <param name="dst">dst Pointer to the 4 byte destination</param>
/// <param name="src">src Pointer to the 4 byte source</param>
void EtherCardW5100::copyIp ( byte *dst, const byte *src )
{
    memcpy ( dst, src, 4 );
}

/// <summary>
/// webutil.cpp - copies a hardware address
/// There is no check of source or destination size. Ensure both are 6 bytes
/// </summary>
/// <param name="dst">dst Pointer to the 6 byte destination</param>
/// <param name="src">src Pointer to the 6 byte destination</param>
void EtherCardW5100::copyMac ( byte *dst, const byte *src )
{
    memcpy ( dst, src, 6 );
}

void EtherCardW5100::printIp ( const char* msg, const uint8_t *buf )
{
    Serial.print ( msg );
    EtherCardW5100::printIp ( buf );
    Serial.println();
}

void EtherCardW5100::printIp ( const __FlashStringHelper *ifsh, const uint8_t *buf )
{
    DEBUG_PRINT ( ifsh );
    EtherCardW5100::printIp ( buf );
    DEBUG_PRINTLN();
}

void EtherCardW5100::printIp ( const uint8_t *buf )
{
    for ( uint8_t i = 0; i < 4; ++i )
    {
        DEBUG_PRINTF ( buf[i], DEC );
        if ( i < 3 )
            DEBUG_PRINT ( '.' );
    }
}

/// <summary>
/// webutil.cpp - search for a string of the form key=value in a string that looks like q?xyz=abc&uvw=defgh HTTP/1.1\\r\\n
/// Ensure strbuf has memory allocated of at least maxlen + 1 (to accomodate result plus terminating null)
/// </summary>
/// <param name="str">Pointer to the null terminated string to search</param>
/// <param name="strbuf">Pointer to buffer to hold null terminated result string</param>
/// <param name="maxlen">Maximum length of result</param>
/// <param name="key">Pointer to null terminated string holding the key to search for</param>
/// <returns>Length of the value. 0 if not found</returns>
byte EtherCardW5100::findKeyVal ( const char *str, char *strbuf, byte maxlen, const char *key )
{
    byte found = 0;
    byte i = 0;
    const char *kp;
    kp = key;
    while ( *str &&  *str != ' ' && *str != '\n' && found == 0 )
    {
        if ( *str == *kp )
        {
            kp++;
            if ( *kp == '\0' )
            {
                str++;
                kp = key;
                if ( *str == '=' )
                {
                    found = 1;
                }
            }
        }
        else
        {
            kp = key;
        }
        str++;
    }
    if ( found == 1 )
    {
        // copy the value to a buffer and terminate it with '\0'
        while ( *str &&  *str != ' ' && *str != '\n' && *str != '&' && i<maxlen - 1 )
        {
            *strbuf = *str;
            i++;
            str++;
            strbuf++;
        }
        *strbuf = '\0';
    }
    // return the length of the value
    return ( i );
}

/// <summary>
/// webutil.cpp - decode a URL string e.g "hello%20joe" or "hello+joe" becomes "hello joe"
/// </summary>
/// <param name="urlbuf">Pointer to the null terminated URL (urlbuf is modified)</param>
void EtherCardW5100::urlDecode ( char *urlbuf )
{
    char c;
    char *dst = urlbuf;
    while ( ( c = *urlbuf ) != 0 )
    {
        if ( c == '+' ) c = ' ';
        if ( c == '%' )
        {
            c = *++urlbuf;
            c = ( h2int ( c ) << 4 ) | h2int ( *++urlbuf );
        }
        *dst++ = c;
        urlbuf++;
    }
    *dst = '\0';
}

/// <summary>
/// webutil.cpp - encode a URL, replacing illegal charaters like ' '.
/// There must be enough space in urlbuf. In the worst case that is 3 times the length of str
/// </summary>
/// <param name="str">str Pointer to the null terminated string to encode</param>
/// <param name="urlbuf">urlbuf Pointer to a buffer to contain the null terminated encoded URL</param>
void EtherCardW5100::urlEncode ( char *str, char *urlbuf )
{
    char c;
    while ( ( c = *str ) != 0 )
    {
        if ( c == ' ' || isalnum ( c ) )
        {
            if ( c == ' ' )
            {
                c = '+';
            }
            *urlbuf = c;
            str++;
            urlbuf++;
            continue;
        }
        *urlbuf = '%';
        urlbuf++;
        int2h ( c, urlbuf );
        urlbuf++;
        urlbuf++;
        str++;
    }
    *urlbuf = '\0';
}

/// <summary>
/// webutil.cpp - Convert an IP address from dotted decimal formated string to 4 bytes
/// </summary>
/// <param name="bytestr">Pointer to the 4 byte array to store IP address</param>
/// <param name="str">Pointer to string to parse</param>
/// <returns>0 on success</returns>
byte EtherCardW5100::parseIp ( byte *bytestr, char *str )
{
    char *sptr;
    byte i = 0;
    sptr = NULL;
    while ( i<4 )
    {
        bytestr[i] = 0;
        i++;
    }
    i = 0;
    while ( *str && i<4 )
    {
        // if a number then start
        if ( sptr == NULL && isdigit ( *str ) )
        {
            sptr = str;
        }
        if ( *str == '.' )
        {
            *str = '\0';
            bytestr[i] = ( atoi ( sptr ) & 0xff );
            i++;
            sptr = NULL;
        }
        str++;
    }
    *str = '\0';
    if ( i == 3 )
    {
        bytestr[i] = ( atoi ( sptr ) & 0xff );
        return ( 0 );
    }
    return ( 1 );
}

/// <summary>
/// webutil.cpp - take a byte string and convert it to a human readable display string
/// </summary>
/// <param name="resultstr">Pointer to a buffer to hold the resulting null terminated string</param>
/// <param name="bytestr">Pointer to the byte array containing the address to convert</param>
/// <param name="len">Length of the array (4 for IP address, 6 for hardware (MAC) address)</param>
/// <param name="separator">Delimiter character (typically '.' for IP address and ':' for hardware (MAC) address)</param>
/// <param name="base">Base for numerical representation (typically 10 for IP address and 16 for hardware (MAC) address</param>
void EtherCardW5100::makeNetStr ( char *resultstr, byte *bytestr, byte len, char separator, byte base )
{
    byte i = 0;
    byte j = 0;
    while ( i<len )
    {
        itoa ( ( int ) bytestr[i], &resultstr[j], base );
        // search end of str:
        while ( resultstr[j] )
        {
            j++;
        }
        resultstr[j] = separator;
        j++;
        i++;
    }
    j--;
    resultstr[j] = '\0';
}

