pbecchi/ESP32-Sprinkler/EtherCardW5100.cpp
//=================================================================================
// enc28j60.cpp
//=================================================================================

/// <summary>
/// enc28j60.cpp - copy recieved packets to data buffer
/// Data buffer is shared by recieve and transmit functions
/// </summary>
/// <returns>Size of recieved data packet</returns>
uint16_t EtherCardW5100::packetReceive()
{
    // listen for incoming clients
    // ** remember this client object is different from the W5100client used for tcp requests **
    incoming_client = incoming_server.available();
	delay(100);
//	incoming_server.setNoDelay(true);
	if (incoming_client) {
		DEBUG_PRINTLN("incoming_client-----------------start");

        // set all bytes in the buffer to 0 - add a
        // byte to simulate space for the TCP header
        memset ( buffer, 0, ETHER_BUFFER_SIZE );
        memset ( buffer, ' ', TCP_OFFSET );
        uint16_t i = TCP_OFFSET; // add a space for TCP offset

        DEBUG_PRINT ( F ( "Server request: " ) );

		while (incoming_client.connected() && (i < ETHER_BUFFER_SIZE)) {
            if ( incoming_client.available() )
                buffer[i] = incoming_client.read();

            // print readable ascii characters
			if (buffer[i] >= 0x08 && buffer[i] <= 0x0D) {
                DEBUG_PRINT ( F ( " " ) );		// substitute a space so less rows in serial output
			} else if (buffer[i] > 0x1F) {
                DEBUG_PRINT ( ( char ) buffer[i] );
            }

            i++;
        }
        DEBUG_PRINTLN ( F ( "" ) );
		incoming_client.flush();   //flush input to avoid remain available
        return i;

    }
    else
        return 0;
}

//=================================================================================
// tcpip.cpp
//=================================================================================

/// <summary>
/// tcpip.cpp - send a response to a HTTP request
/// </summary>
/// <param name="dlen">Size of the HTTP (TCP) payload</param>
void EtherCardW5100::httpServerReply ( word dlen )
{
    // ignore dlen - just add a null termination
    // to the buffer and print it out to the client
    buffer[bfill.position() + TCP_OFFSET] = '\0';
    incoming_client.print ( ( char* ) bfill.buffer() );

    // close the connection:
//    delay ( 1 ); // give the web browser time to receive the data
//    incoming_client.stop();
}

/// <summary>
/// tcpip.cpp - send a response to a HTTP request
/// </summary>
/// <param name="dlen">Size of the HTTP (TCP) payload</param>
/// <param name="flags">TCP flags</param>
void EtherCardW5100::httpServerReply_with_flags ( uint16_t dlen, uint8_t flags )
{
    // Need functionality to handle:
    //     - TCP_FLAGS_ACK_V
    //     - TCP_FLAGS_FIN_V
    //     - TCP_FLAGS_ACK_V|TCP_FLAGS_FIN_V

    // Same as above - ignore dlen & just add a null termination and print it out to the client
    buffer[bfill.position() + TCP_OFFSET] = '\0';
    incoming_client.print ( ( char* ) bfill.buffer() );
    delay ( 20 ); // give the web browser time to receive the data

    if ( flags&TCP_FLAGS_FIN_V != 0 ) // final packet in the stream
    {
        // close the connection:
        incoming_client.stop();
		DEBUG_PRINTLN("Client STOP----------------------------");
    }

    /* // Original Code from tcpip.cpp
    for(byte i=0;i<=dup;i++)
    {
    set_seq();
    gPB[TCP_FLAGS_P] = flags; // final packet
    make_tcp_ack_with_data_noflags(dlen); // send data
    }
    //if(keepseq) {}
    //else {SEQ=SEQ+dlen;}
    SEQ=SEQ+dlen;
    */
}

/// <summary>
/// tcpip.cpp - acknowledge TCP message
/// </summary>
void EtherCardW5100::httpServerReplyAck()
{
    /*
    make_tcp_ack_from_any(info_data_len,0); // send ack for http get
    get_seq(); //get the sequence number of packets after an ack from GET
    */
}

/// <summary>
/// Populate the bufferfiller with www request header
/// </summary>
/// <param name="fd">File descriptor (always www_fd)</param>
/// <returns>current buffer filler position including TCP_OFFSET</returns>
uint16_t EtherCardW5100::www_client_internal_datafill_cb ( uint8_t fd )
{
    bfill = EtherCardW5100::tcpOffset();

    if ( fd == www_fd )
    {
        if ( client_postval == 0 )
        {
            bfill.emit_p ( PSTR ( "GET $F$S HTTP/1.0\r\n"
                                  "Host: $F\r\n"
                                  "$F\r\n"
                                  "\r\n" ), client_urlbuf,
                           client_urlbuf_var,
                           client_hoststr, client_additionalheaderline );
        }
        else
        {
            const char* ahl = client_additionalheaderline;
            bfill.emit_p ( PSTR ( "POST $F HTTP/1.0\r\n"
                                  "Host: $F\r\n"
                                  "$F$S"
                                  "Accept: */*\r\n"
                                  "Content-Length: $D\r\n"
                                  "Content-Type: application/x-www-form-urlencoded\r\n"
                                  "\r\n"
                                  "$S" ), client_urlbuf,
                           client_hoststr,
                           ahl != 0 ? ahl : PSTR ( "" ),
                           ahl != 0 ? "\r\n" : "",
                           strlen ( client_postval ),
                           client_postval );
        }
    }
    return bfill.position();
}

/// <summary>
/// tcpip.cpp - prepare and send HTTP request
/// </summary>
/// <param name="urlbuf">Pointer to c-string URL folder</param>
/// <param name="urlbuf_varpart">Pointer to c-string URL file</param>
/// <param name="hoststr">Pointer to c-string hostname</param>
/// <param name="callback">Pointer to callback function to handle response</param>
void EtherCardW5100::browseUrl ( const char *urlbuf, const char *urlbuf_varpart, const char *hoststr, void ( *callback ) ( uint8_t, uint16_t, uint16_t ) )
{
    browseUrl ( urlbuf, urlbuf_varpart, hoststr, PSTR ( "Accept: text/html" ), callback );
}

/// <summary>
/// tcpip.cpp - prepare and send HTTP request / the reply is received in the main packetloop
/// </summary>
/// <param name="urlbuf">Pointer to c-string URL folder</param>
/// <param name="urlbuf_varpart">Pointer to c-string URL file</param>
/// <param name="hoststr">Pointer to c-string hostname</param>
/// <param name="additionalheaderline">additionalheaderline Pointer to c-string with additional HTTP header info</param>
/// <param name="callback">callback Pointer to callback function to handle response</param>
void EtherCardW5100::browseUrl ( const char *urlbuf, const char *urlbuf_varpart, const char *hoststr, const char *additionalheaderline, void ( *callback ) ( uint8_t, uint16_t, uint16_t ) )
{
    client_urlbuf = urlbuf;
    client_urlbuf_var = urlbuf_varpart;
    client_hoststr = hoststr;
    client_additionalheaderline = additionalheaderline;
    client_postval = 0;
    client_browser_cb = callback;
//    client_tcp_datafill_cb = &www_client_internal_datafill_cb;

    // check cb pointer is 'real' (non zero)
    if ( !client_browser_cb )
        return;
	

    // fill the buffer  host_name_should be loaded here
    uint16_t len = ( *www_client_internal_datafill_cb ) ( www_fd );
    buffer[bfill.position() + TCP_OFFSET] = '\0';

    DEBUG_PRINT ( F ( "Browse URL: " ) );

    for ( uint16_t c = TCP_OFFSET; c < bfill.position() + TCP_OFFSET; c++ )
    {
        // print readable ascii characters
        if ( buffer[c] >= 0x08 && buffer[c] <= 0x0D )
        {
            DEBUG_PRINT ( ( char ) buffer[c] ); // DEBUG_PRINT ( F ( " " ) );		// substitute a space so less rows in serial output
        }
        else if ( buffer[c] > 0x1F )
        {
            DEBUG_PRINT ( ( char ) buffer[c] );
        }
    }
    // close any connection before send a new request, to free the socket
    outgoing_client.stop();
	bool connected = false;
	delay(1000);
	DEBUG_PRINT("hoststring=");
#if defined  (ESP32)||defined(ESP8266)
	if (hoststr == "*") {
		DEBUG_PRINTLN(IPAddress(hisip[0], hisip[1], hisip[2], hisip[3]));
		connected = outgoing_client.connect(IPAddress(hisip[0], hisip[1], hisip[2], hisip[3]), hisport);
	}
	else
#endif
		connected=outgoing_client.connect(hoststr, hisport);
	 for (int i = 0; i < strlen(hoststr); i++)DEBUG_PRINT(hoststr[i]);
    // send the request
    if (connected )
		//-------------modified *hoststr now=weather.opensprinkler.com was "*"
    {
        // send the HTTP GET request:
        outgoing_client.print ( ( char* ) bfill.buffer() );
        outgoing_client.println();
        DEBUG_PRINT ( F ( "Browse URL: sent to " ) );
        DEBUG_PRINT ( hoststr );
        DEBUG_PRINT ( F ( " port " ) );
        DEBUG_PRINT ( hisport );
        DEBUG_PRINTLN ( F ( "(OK)" ) );
        outgoing_client_state = TCP_ESTABLISHED;
#ifndef MOD1
		byte w = 0; ////_wait to receive from server___________________________________
			while (!outgoing_client.available() && w++ < 255) delay(40);
			if (w < 255) {
				DEBUG_PRINT(F("Browse URL: client received: "));

