pbecchi/ESP32-Sprinkler/EtherCardW5100.cpp
				// set all bytes in the buffer to 0 - add a
				// byte to simulate space for the TCP header
				memset(buffer, 0, ETHER_BUFFER_SIZE);
				memset(buffer, ' ', TCP_OFFSET);
				len = TCP_OFFSET;

				while (outgoing_client.available() && (len < ETHER_BUFFER_SIZE)) {
					buffer[len] = outgoing_client.read();
					DEBUG_PRINT(char(buffer[len] & 0xFF));
					len++;
				}
				DEBUG_PRINTLN(F(""));

				// send data to the callback
				if (len > TCP_OFFSET) {
					(*client_browser_cb) (0, TCP_OFFSET, len);

				}
			}
				outgoing_client_state = TCP_CLOSED;
				outgoing_client.stop();
//release incoming server if lost......................................
			
#endif
    }
    else
    {
        DEBUG_PRINTLN ( F ( "Browse URL: failed (could not connect)" ) );
        outgoing_client_state = TCP_CLOSED;
		outgoing_client.stop();
    }
}

/// <summary>
/// tcp.cpp - send ping
/// </summary>
/// <param name="destip">Pointer to 4 byte destination IP address</param>
void EtherCardW5100::clientIcmpRequest ( const uint8_t *destip )
{
#ifdef MY_PING
    IPAddress pingAddr ( destip[0], destip[1], destip[2], destip[3] ); // ip address to ping

    DEBUG_PRINT ( F ( "Ping: to " ) );
    DEBUG_PRINT ( destip[0] );
    DEBUG_PRINT ( F ( "." ) );
    DEBUG_PRINT ( destip[1] );
    DEBUG_PRINT ( F ( "." ) );
    DEBUG_PRINT ( destip[2] );
    DEBUG_PRINT ( F ( "." ) );
    DEBUG_PRINT ( destip[3] );

    // note - asynchStart will return false if we couldn't even send a ping
    if ( !ping.asyncStart ( pingAddr, 3, ping_result ) )
    {
        DEBUG_PRINT ( F ( " send failed (status=" ) );
        DEBUG_PRINT ( ( int ) ping_result.status );
        DEBUG_PRINTLN ( F ( ")" ) );
    }
    else
    {
        DEBUG_PRINTLN ( F ( " sent (OK)" ) );
    }
#endif


}

/// <summary>
/// tcp.cpp - check for ping response
/// </summary>
/// <param name="ip_monitoredhost">Pointer to 4 byte IP address of host to check</param>
/// <returns>True (1) if ping response from specified host</returns>
uint8_t EtherCardW5100::packetLoopIcmpCheckReply ( const uint8_t *ip_monitoredhost )
{
#ifndef MY_PING
#ifdef ESP8266
	return Ping.ping(IPAddress(ip_monitoredhost[0], ip_monitoredhost[1], ip_monitoredhost[2], ip_monitoredhost[3]));
#elif defined(ESP32)
	if (WiFi.status() == WL_CONNECTED) return true; else return false;
#endif
#else
    if ( ping.asyncComplete ( ping_result ) )
    {
        DEBUG_PRINT ( F ( "Ping: " ) );

        if ( ping_result.status != SUCCESS )
        {
            // failure... but whyyyy?
            DEBUG_PRINT ( F ( " failed (status=" ) );
            DEBUG_PRINT ( ping_result.status );
            DEBUG_PRINTLN ( F ( ")" ) );
            return 0;
        }
        else
        {
            // huzzah
            DEBUG_PRINT ( F ( " reply " ) );
            DEBUG_PRINT ( ping_result.data.seq );
            DEBUG_PRINT ( F ( " from " ) );
            DEBUG_PRINT ( ping_result.addr[0] );
            DEBUG_PRINT ( F ( "." ) );
            DEBUG_PRINT ( ping_result.addr[1] );
            DEBUG_PRINT ( F ( "." ) );
            DEBUG_PRINT ( ping_result.addr[2] );
            DEBUG_PRINT ( F ( "." ) );
            DEBUG_PRINT ( ping_result.addr[3] );
            DEBUG_PRINT ( F ( " bytes=" ) );
            DEBUG_PRINT ( REQ_DATASIZE );
            DEBUG_PRINT ( F ( " time=" ) );
            DEBUG_PRINT ( millis() - ping_result.data.time );
            DEBUG_PRINT ( F ( " TTL=" ) );
            DEBUG_PRINT ( ping_result.ttl );

            // check the address
            if ( ping_result.addr[0] == ip_monitoredhost[0] &&
                    ping_result.addr[1] == ip_monitoredhost[1] &&
                    ping_result.addr[2] == ip_monitoredhost[2] &&
                    ping_result.addr[3] == ip_monitoredhost[3] )
            {
                DEBUG_PRINTLN ( F ( " (OK)" ) );
                return 1;
            }
            else
            {
                DEBUG_PRINTLN ( F ( " (received from wrong host)" ) );
                return 0;
            }
        }
    }
#endif
}

/*
/// <summary>
/// get the sequence number of packets after an ack from GET
/// </summary>
static void get_seq()
{
    SEQ = ( ( ( unsigned long ) gPB[TCP_SEQ_H_P] * 256 + gPB[TCP_SEQ_H_P + 1] ) * 256 + gPB[TCP_SEQ_H_P + 2] ) * 256 + gPB[TCP_SEQ_H_P + 3];
} //thanks to mstuetz for the missing (unsigned long)

/// <summary>
/// Set the correct sequence number and calculate the next with the length of current packet
/// </summary>
static void set_seq()
{
    gPB[TCP_SEQ_H_P] = ( SEQ & 0xff000000 ) >> 24;
    gPB[TCP_SEQ_H_P + 1] = ( SEQ & 0xff0000 ) >> 16;
    gPB[TCP_SEQ_H_P + 2] = ( SEQ & 0xff00 ) >> 8;
    gPB[TCP_SEQ_H_P + 3] = ( SEQ & 0xff );
}
*/
//=================================================================================
// dns.cpp
//=================================================================================

/// /// <summary>
/// dns.cpp - perform DNS lookup. Result is stored in hisip member.
/// </summary>
/// <param name="name">Host name to lookup</param>
/// <param name="fromRam">NOT IMPLEMENTED (Look up cached name. Default = false)</param>
/// <returns>True on success. </returns>

bool EtherCardW5100::dnsLookup(const char* name, bool fromRam)
{

	IPAddress serverIP(0, 0, 0, 0);
	DEBUG_PRINT(name);
	DEBUG_PRINTLN(" Starting LOOKUP");


#if  defined(ESP8266)     //use WiFi.hostByName
	int result = 0;
	dns_client.begin(ETHERNE.gatewayIP());   ////--may not be necessary
	int result = ETHERNE.hostByName(name, serverIP);
#elif defined(ESP32)

	int result = 0;	////---
	
	WiFi.hostByName(name, serverIP);

#else
	dns_client.begin(Ethernet.dnsServerIP()); 
	int result = dns_client.getHostByName(name, serverIP);
#endif

    DEBUG_PRINT ( F ( "DNS lookup " ) );
    DEBUG_PRINT ( name );
    DEBUG_PRINT ( F ( " is " ) );
    DEBUG_PRINT ( serverIP[0] );
    DEBUG_PRINT ( F ( "." ) );
    DEBUG_PRINT ( serverIP[1] );
    DEBUG_PRINT ( F ( "." ) );
    DEBUG_PRINT ( serverIP[2] );
    DEBUG_PRINT ( F ( "." ) );
    DEBUG_PRINT ( serverIP[3] );

    for ( uint8_t i = 0; i < 4; i++ )
        hisip[i] = serverIP[i];

    if ( result == 1 )
    {
        DEBUG_PRINTLN ( F ( " (OK)" ) );
        return true;
    }
    else
    {
        DEBUG_PRINTLN ( F ( " (failed)" ) );
        return false;
    }
}

// EXEC OTA for firmware OTA download from cloud (http: download) 
#ifdef ESP32_CLOUD_OTA
#include <Update.h>
// OTA Logic

